let character_array = [
{
  name: "balu",
  char_text: "<b>Балу</b> (англ. Baloo) — девтерагонист диснеевского полнометражного мультфильма 1967 года «Книга джунглей». Он — беспечный и добродушный медведь-губач, который становится лучшим другом «человеческого детёныша» по имени Маугли. Балу легко характеризуем по своей весёлой и беспечной натуре. Он любит веселиться, танцевать, играть и проводить время со своим другом Маугли и поэтому, даже когда это надо, Балу ненавидит быть серьёзным и грустить. Но несмотря на свою чрезмерную беспечность, Балу в некоторых случаях способен проявлять ответственность и предусмотрительность. Ко всему прочему, Балу очень храбрый, самоотверженный, защититник и всегда готов прийти на помощь своим друзьям, что можно заметить, когда Балу пытался защитить Маугли от опасного тигра Шер-Хана."
},

{
  name: "bembi",
  char_text: "<b>Бемби</b> (или Бэмби; англ. Bambi) — главный персонаж диснеевского полнометражного мультфильма 1942 года. Он — молодой олень-принц, живущий в лесу, сын Великого Князя леса и лучший друг зайца Топотуна и скунса Цветочка. Едва появившись на свет, Бэмби демонстрирует приветливость и дружелюбие к другим жителям леса, чем у многих из них вызывает умиление, и даже успел завести первую дружбу с зайчонком Топотуном, которая впоследствии закрепилась навсегда. Оленёнок очень любознательный и интересуется буквально всем вокруг, а иногда настолько, что не замечает приближающейся опасности.  Он любит свою маму и очень ею дорожит, поэтому всегда слушается её и в первое время после её гибели продолжал питать веру в то, что она жива и однажды вернётся к нему."
},

{
  name: "mikky",
  char_text: "<b>Микки Маус</b> (Мышонок Микки, англ. Mickey Mouse) — мультяшный антропоморфный мышонок, созданный Уолтом Диснеем и Абом Айверксом в 1928. Пожалуй, сейчас это самый популярный герой. Микки является талисманом The Walt Disney Company. Микки - чёрный мышонок с белым (впоследствии слегка коричневатым) лицом. Костюм его может меняться, но его классической одеждой являются красные шорты с белыми пуговицами, большие жёлтые ботинки и обязательные белые перчатки (правда так стало после появления цветных мультфильмов). Слегка изменились глаза - первоначально они обозначались чёрными точками-овалами, а позже стали нормальными глазами."
},
{
  name: "nick",
  char_text: "<b>Николас «Ник» Уайлд</b> (англ. Nicholas «Nick» Wilde) — девтерагонист диснеевского полнометражного мультфильма 2016 года «Зверополис». Он — хитрый и харизматичный лис-мошенник, который невольно становится помощником начинающего офицера полиции Джуди Хопс, расследующей дело о массовом исчезновении животных. Из-за давней детской травмы, он имеет весьма циничный взгляд на жизнь и старается соответствовать стереотипу «хитрого и бессовестного лиса», каким его все и всегда считали. Однако, несмотря на их различия, Ник заводит дружбу с Джуди, и та в итоге помогает ему осознать, что он не должен, следуя предубеждениям общества, быть тем, кем на самом деле не является. Ник Уайлд умён, хитёр и находчив. Уайлд в меру болтлив и очень остёр на язык, с авторитетами может даже быть дерзок."
},

{
  name: "perry",
  char_text: "<b>Перри Утконос</b>, также известный как Агент Пи - домашний утконос Финеса и Ферба, который втайне от хозяев живёт двойной жизнью, работая в секретной государственной организации О.Б.К.А. (Организация Без Крутой Аббревиатуры), в которой работают животные-шпионы. В агентстве его начальник - майор Монограмм. Обыкновенное поведение Перри - изображение самого обыкновенного безмозглого утконоса на глазах у своих владельцев, Финеса и Ферба. У Перри есть логово под домом Флинн-Флетчеров, в которое можно попасть через различные потайные ходы. Один из них - это лифт-труба, по которому также спускается и Санта-Клаус. Другими примерами могут послужить лифт в дереве, проход из одной из сторон дома и множество других, некоторые из них находятся на другом конце города или даже в Китае."
},

{
  name: "pongo",
  char_text: "<b>Понго</b> (англ. Pongo) — протагонист диснеевского полнометражного мультфильма 1961 года «Сто один далматинец». Как и его владелец, Роджер, Понго непринужденный, игривый и немного глупый. Помимо этого, он чрезвычайно предан, и на самом деле принял к сведению одиночество Роджера как холостяка-песенника, тем самым сделав его своей миссией найти для своего питомца спутника жизни. Благодаря этому, Понго - причина, по которой Роджер и его жена, Анита, действительно собрались вместе. На протяжении всего приключения были продемонстрированы разные стороны личности Понго. Он показал себя умным, тактическим и скрытным."
},

{
  name: "remi",
  char_text: "<b>Реми</b> (англ. Remy) - главный протагонист мультфильма Рататуй. Он серая, среднего размера крыса, мечтающая стать шеф-поваром. Реми очень любит продукты приготовленные качественно и со вкусом. Именно благодаря этому его друг - Огюст Гюсто, а точнее его спектральная форма. Его заветная мечта - стать шеф-поваром и он всегда старается приготовить что-то, если находит ингредиенты. Когда он находит Лингвини и понимает, что он может контролировать его движения, он готовит высококачественные блюда, прячась в колпаке Лингвини. В конце фильма его мечта сбывается, он становится лучшим шеф-поваром в Париже, в новом бистро Ля Рататуй."
},

{
  name: "seb",
  char_text: "<b>Себастьян</b> (англ. Sebastian) - краб из мультфильма «Русалочка». Он является верным другом Ариэль и всегда помогает ей. Себастьян так же является помощником короля Тритона и его главным советником. Себастьян готов на всё, чтобы доказать свою преданность королю Тритону и бесстрашие, даже стать послом во враждебной Акуляндии. Себастьян хотя он кажется напыщенным, но он так же добродушный и осторожный. Несмотря ни на что, его все любят. У него шесть ножек и две клешни, которыми он действует как руками. Несмотря на это, у него вполне человеческое лицо. Он красного цвета. Является дирижёром оркестра и мечтает поразить публику. Очень недоволен поведением Ариэль, но получает от Тритона приказ следить за ней."
},

{
  name: "simba",
  char_text: "<b>Симба</b> — главный герой анимационного фильма «Король Лев», нынешний правитель Земель прайда. Родился во времена правления короля Муфасы и является его прямым и единственным наследником. Сейчас он правит своими владениями вместе с подругой детства Налой и воспитывает с ней детёнышей — принцессу-наследницу Киару и сына Кайона, лидера Львиной Охраны. В детские годы Симба был озорным и энергичным, постоянно жаждущим приключений львёнком. Он напоминает обоих родителей. От Муфасы он унаследовал крепкое телосложение и окрас шерсти. Основной его цвет золотой, а грива тёмно-красная. Морда, пальцы лап и подбрюшье у него кремовые. От Сараби он унаследовал чёрные окантовки на ушах (хоть они и пропали с возрастом) и некоторые другие черты лица. У Симбы оранжевые глаза, розовый нос."
},

{
  name: "vinny",
  char_text: "<b>Винни-Пух</b> (англ. Winnie the Pooh) - самый главный друг Кристофера Робина. Знаменитый житель Стоакрового Леса. Плюшевый мишка жёлтого окраса, набитый опилками. Обычно Винни носит красный джемпер. Зимой носит фиолетовую куртку с белым шарфом. В сериале ещё и красно-зелёный колпак-шапку. В «Мои друзья Тигруля и Винни» носит тёмно-синий джемпер с эмблемой следопытов и маску. У Винни спокойный характер. Иногда он выдаёт глупые идеи, но он очень добрый и верный друг. "
},

{
  name: "nemo",
  char_text: "<b>Немо</b> (англ. Nemo) — тритагонист диснеевского/пиксаровского полнометражного мультфильма 2003 года «В поисках Немо» и основной персонаж его сиквела 2016 года «В поисках Дори». Немо — очень энергичная молодая рыбка-клоун. Он очень хотел пойти в школу в начале фильма. С тем, кого он видит, он ведёт себя вполне дружелюбно. Он также очень смелый, что показано, когда он был готов рисковать своей жизнью, чтобы сломать фильтр, услышав о том, что его отец с придёт и спасёт его, и когда он охотно вступил в сеть, которая захватила стаю рыб, чтобы сделать их свободными. Немо, как любая рыба-клоун имеет ярко-оранжевый окрас и широкие белые полосы, обведённые маленькими чёрными. Правый плавник Немо недоразвит - он заметно меньше левого (причина не совсем ясна)."
},

{
  name: "sven",
  char_text: "<b>Свен</b> (англ. Sven) - персонаж полнометражного мультфильма 2013 года «Холодное сердце», а также короткометражного мультфильма 2015 года «Холодное торжество». Свен - транспортное средство Кристоффа, а также лучший друг. Выглядит, как красивый бело-коричневый северный олень. Очень любит морковку, что продемонстрировал, украв нос-морковку Олаф. Кристофф тоже иногда покупал Свену морковку. Поведение Свена очень похоже на поведение собаки. Иногда он демонстрирует разум - так в «Олафе и холодном приключении» он продемонстрировал, что стало с Олафом."
},

{
  name: "black",
  char_text: "<b>Чёрный Плащ</b> (англ. Darkwing Duck; в реальной жизни Кряк Лапчатый, англ. Drake Mallard) — протагонист диснеевского телевизионного мультсериала «Чёрный Плащ». Чёрный Плащ — супергерой, который живёт в вымышленном городе Сен-Канар. Но в обычной жизни он вовсе не герой, а простой гражданин — Кряк Лапчатый. У Чёрного Плаща есть приёмная дочь Гусёна. До знакомства с Зигзагом и Гусёной Кряк жил в высокой башне на главном мосту города, однако позже у него появляется полноценный дом. Башня остаётся штаб-квартирой Чёрного Плаща. ЧП — обыкновенная утка, однако он выделяется из всех вытянутым вверх черепом. В обычном образе Кряк носит розовую рубашку и зелёный жилет «в ромбик». В образе «борца со злом» Кряк носит большую шляпу, двубортный пиджак с голубой водолазкой, фиолетовую маску на лице и, конечно, свой плащ."
},

{
  name: "chd",
  char_text: "<b>Чип и Дейл</b> (англ. Chip and Dale) — друзья-бурундуки. Чип является мозгом дуэта, т. к. он более умный и бесстрашный, а так же гораздо быстрее мыслит. Так он видит в Дональде угрозу. Чип так же легко расстраивается из-за некомпетентности Дейла. В мультсериале он показан лидером команды Спасателей. Промахи Дейла вызывают у него головную боль. В отличие от большинства персонажей Микки Мауса, Чип и Дейл ведут себя как обычные бурундуки; они живут на обычных деревьях (обычно на заднем дворе или в лесу) и проводят большую часть времени, собирая и храня орехи. Их склонность к еде часто заставляет их красть ее у других, что является постоянным предметом спора между бурундуками и их главным соперником Дональдом Даком. В «Чип и Дейл спешат на помощь» Дейл носит гавайскую рубашку, возможно, чтобы показать, насколько расслаблена его личность. А Чип носит лётную куртку и шапку в стиле Индианы Джонса."
},

{
  name: "dambo",
  char_text: "<b>Дамбо</b> (англ. Dumbo) — протагонист одноимённого диснеевского полнометражного мультфильма 1941 года. Дамбо - маленький азиатский слон. Его кожа серая, глаза голубые, а хвост очень маленький. Его уши очень большие (что другие слоны не любят), но он использует их как импровизированные крылья, чтобы летать. У него небольшой хоботок с двумя большими ноздрями на конце. Дамбо - личность маленького ребенка. Он игривый, невинный и очень веселый. Он любит быть рядом с матерью и ненавидит одиночество. Он несколько наивен, поскольку он не понимал, что Смитти и его банда дразнили его или что волшебное перо было просто способом мышления. Дамбо тоже очень легко пугается, о чем свидетельствуют его встречи с клоунами, розовыми слонами и, как и все слоны, Тимоти Маусом. Тем не менее, он также очень открыт сердцем, например, с Тимоти и Джимом Кроу и его братьями, и, казалось, никогда не выражал никакого истинного гнева или негодования по отношению к тем, кто дразнит его."
}

  ]

