let answers = {
    "f" : {
        "description" : "Вы — Доктор Хайнц Фуфелшмертц.<br>Очень изобретательный и коварный злодей! Поздравляю!",
        "image" : "img/fuf.jpg",
    } ,
    "v" : {
        "description" : "Вы — Вэриан.<br>Поздравляю, вы завалили тест!  Вэриан - добрый и милый малый. Не понимаю, как он попал в данную категорию.",
        "image" : "img/verian.jpg",
    } ,
    "ai" : {
        "description" : "Вы — Аид.<br>Всемогущий и сильный бог. Поздравляю!",
        "image" : "img/aid.jpg",
    } ,
    "s" : {
        "description" : "Вы — Шиго.<br>Бесподобная и сногшибательная, в прямом смысле. Поздравляю!",
        "image" : "img/shego.jpg",
    } ,
    "i" : {
        "description" : "Вы — Изма.<br>Хитрая и гениальная. Поздравляю!",
        "image" : "img/izma.jpg",
    } ,
    "m" : {
        "description" : "Вы — Малефисента.<br>Чистое воплощение зла. Поздравляю!",
        "image" : "img/malefisenta.jpg",
    } ,
};