const quiz = [
    {
        "q": "Каков ваш зловещий план? 1/8",
        "a" : {
            "f": "Построю очередной инатор с кнопкой самоуничтожения!!!",
            "v": "У меня много планов! Неважно каких!",
            "ai" : "Сделаю своего врага смертным. А там посмотрим...",
            "s" : "А что, у нас был план?",
            "i" : "Превращу своего врага в ламу!",
            "m" : "Ну, план был."
        }
    },
     {
        "q": "Какую цель вы преследуете? 2/8",
        "a" : {
            "f": " Захвачу триштатье, т. к. у меня психтравма из детства",
            "v": "Мне нужно спасти близкого мне человека",
            "ai" : "Олимп будет моим!",
            "s" : "Надо поставить эту выскочку на место",
            "i" : "Хочу стать имератрицей",
            "m" : "Месть. Никогда не забуду той обиды"
        }
    },
     {
        "q": "Вы когда-нибудь думали перейти на сторону добра? 3/8",
        "a" : {
            "f": "Иногда я примыкаю к стороне добра, чтобы помочь им справиться с противником похуже меня",
            "v": "Я не злой!!! Мне просто нужна помощь!",
            "ai" : "До конца дней своих буду проводить время в аду",
            "s" : "Хахаха! Ни за что! Ну, или может, когда появится кто-то, из-за кого я поменяю свое мнение!",
            "i" : "Никогда!!!",
            "m" : "Мое ледяное сердце возможно растопить"
        }
    },
       {
        "q": "Что насчет вашего врага? Какой он? 4/8",
        "a" : {
             "f":"У-у-утконос...Вы видели? Он в шлапке спецагента!!!",
            "v": "Принцесса с волшебными волосами. А я не признаю существование магии!",
            "ai" : "Сильный маскулистый полубог",
            "s" : "Рыжая бестия",
            "i" : "Хилый никчемный подросток",
            "m" : "Все. Меня никто не понимает"
        }
    },
      {
        "q": "Как вы выглядите в своем зловещем облике? 5/8",
        "a" : {
             "f": "Белый халатик и брюки поудобнее",
            "v": "В специализированной рабочей одежде",
            "ai" : "Надену какие-то старые лахмотья и буду доволен",
            "s" : "Облегающий костюмчик как у супер-героя, но лучше!",
            "i" : "Больше фиолетового и перья - то, что нужно!",
            "m" : "Большие рога и черный цвет - цвет истинного зла!"
        }
    },
    {
        "q": " Какими способностями вы обладаете? 6/8",
        "a" : {
            "f": "Машиностроение. Ну, а что?",
            "v": "АЛХИИИМИЯ!",
            "ai" : "Я бог смерти.",
            "s" : "Я физически силен, и иногда из моих рук выходит пламя",
            "i" : "Могу сделать любое зелье!",
            "m" : "Магия. Летать могу"
        }
    },
       {
        "q": "Какой у вас характер? 7/8",
        "a" : {
            "f": "Изобретательный, а также злопамятный злодей",
            "v": "Слегка неуклюжий и очень ранимый злодей",
            "ai" : "Легко приходите в ярость и страдаете комплексом превосходства",
            "s" : "Умный и самовлюбленный злодей",
            "i" : "Хитрый и властолюбивый злодей",
            "m": "Живое олицетворение истинного и абсолютного зла"
        }
    },
        {
        "q": "Где вы творите свои злодеяния? 8/8",
        "a" : {
            "f": "В башне, что возвышается над всем городом",
            "v": "Под своим домом организовал тайный подвал",
            "ai" : "В своем собственном царстве - в аду",
            "s" : "Где мой враг, там и я",
            "i" : "Моя зловещая лаборатория находится в подвале замка. Жми на рычаг Кронк!",
            "m": "Где-то в страшном волшебном лесу"
        }
    }
];