let character_array = [
{
  name: "hiro",
  char_text: "<b>Хиро Хамада</b> (англ. Hiro Hamada) — протагонист диснеевского полнометражного мультфильма 2014 года «Город героев». Он — четырнадцатилетний вундеркинд робототехники, проживающий в городе Сан-Франсокио под опекой своей тёти и старшего брата Тадаши. После трагической гибели Тадаши от рук злодея в маске кабуки Хиро становится основателем и лидером Шестёрки героев — команды молодых супергероев.Хиро Хамада — подросток с невероятно высоким для его возраста уровнем интеллекта. Из отрицательных качеств можно назвать его склонность переоценивать свои способности, а также хвастовство. Но всё же он является добрым парнишкой и верным другом."
},

{
  name: "kuzco",
  char_text: "<b>Император Кузко</b> (англ. Emperor Kuzco) — протагонист диснеевского полнометражного мультфильма 2000 года «Похождения императора».Кузко — главный герой, чрезвычайно самолюбив, эгоистичен, очень ленив, не любит работать. Немного глуповат. Безумно влюблен в Мэлину, собирается жениться на ней. Император. На протяжении всего сериала превращается в зверей под воздействием зелий Измы. По его словам больше всего боится пауков и гравитации.Внешне он выглядит как худощавый черноволосый парень. В оригинале он ходит в национальном костюме инков.Как и положено царственной особе, император Кузко — очень занятой человек."
},

{
  name: "lilo",
  char_text: "<b>Лило Пелекаи</b> (англ. Lilo Pelekai) - маленькая гавайская девочка, одна из главных персонажей франшизы Лило и Стич. Она живет на острове Кауаи вместе со своей старшей сестрой Нани и со своими инопланетными «родственниками».Лило - это очень энергичная и неординарная девочка. В свое время из-за смерти своих родителей, она очень отдалилась от сверстников. Недостаток в общении восполняет ее лучший друг, незаконный генетический эксперимент по имени Стич, которого она сначала принимает за пса.Она очень непослушная. Так как Лило в раннем возрасте потеряла родителей, то проявляет свою чувствительность и обычно от этого плачет."
},

{
  name: "gerk",
  char_text: "<b>Геркулес</b> (англ. Hercules) — главный протагонист диснеевского полнометражного мультипликационного фильма 1997 года с тем же названием. Также появляется в сериале Однажды в сказке. Геркулес родился на Олимпе и был окружён любовью родителей. Но Аид узнал, что он помешает ему захватить мир. Поэтому он велел Боли и Панику похитить Геркулеса и сделать смертным. Геркулес обращается за помощью к сатиру Филоктету и вместе с верным крылатым конём Пегасом приступает к тренировкам. В результате протагонист возмужал, окреп, стал ловким и выносливым. У персонажа голубые глаза (полученные от матери) и рыжие волосы. В юном возрасте Геркулес был очень худым, но после многих тренировок с Филом стал атлетически сложен."
},

{
  name: "god",
  char_text: "<b>Юджин Фицерберт</b> (англ. Eugene Fitzherbert; более известный как Флин Райдер, англ. Flynn Rider) — девтерагонист диснеевского полнометражного мультфильма 2010 года «Рапунцель: Запутанная история». Флин, известный своим обаянием и сообразительностью.Самоуверенный Флин Райдер просто обожает себя любимого. Долгое время смекалка обаяние и внешняя привлекательность выручали его из разных передряг, — и так уж получилось, что их в его жизни было предостаточно. Флин — вор в поисках последнего большого дела, которое позволит ему, наконец, жить так, как он всегда мечтал. Никогда ещё он не был так близок к своей мечте, как в тот день, когда ему повстречалась Рапунцель, странная девушка с невероятно длинными волосами. Рапунцель, похоже, единственная девушка, на которую не действуют чары Флина, и, кажется, он впервые встретил достойного соперника."
},

{
  name: "maui",
  char_text: "<b>Мауи</b> (англ. Maui) — является девтерагнистом анимационного фильма Моана студии Disney, вышедшего в 2016 году. Мауи — наполовину Бог, наполовину смертный, всем крут. Главная его способность - менять облик, но он способен на это только если у него есть его волшебный крюк. А еще он весьма хорошо разбирается в мореходстве. Также Боги наделили Мауи невероятной силой, что позволило ему вытянуть гигантские острова из океана, притянуть ближе Солнце и обуздать ветер. Можно предположить, что он немного эгоистичный и высокомерный. Так он обманывает Моану, заманивая её в пещеру, а сам сбегает на её лодке."
},

{
  name: "migel",
  char_text: "<b>Мигель Ривера</b> (англ. Miguel Rivera) — протагонист диснеевского/пиксаровского полнометражного мультфильма 2017 года «Тайна Коко». Мигель очень мечтательная натура. Так он мечтает стать музыкантом, несмотря на все запреты.Он также очень добрый и очень любит свою семью. Мигель хорошо играет на гитаре. У Мигеля типичная мексиканская внешность. У него чёрные волосы и карие глаза.Он носит белую майку, светлые джинсы, коричневые ботинки и красную толстовку с капюшоном."
},

{
  name: "phineas",
  char_text: "<b>Финес Флинн</b> - главный герой мультфильма Финес и Ферб. Финес мальчик в семье Флинн-Флетчеров; является сыном Линды Флинн и приёмным сыном Лоренса Флетчера. В семье он один из трёх детей, остальные двое - его старшая сестра Кэндес и сводный брат, сын Лоренса, Ферб. У него есть любимый питомец - утконос Перри. Как и все остальные в семье, Финес не знает, что Перри секретный агент. Как оптимист, Финес всегда смотрит на любые вещи с хорошей стороны. Также он невероятно умён, изобретателен и креативен, и даже создаёт свои невероятные штуковины со своим братом Фербом. Благодаря своей дружелюбности, в воплощении своих идей у него всегда много помощников."
},

{
  name: "tarzan",
  char_text: "<b>Тарзан</b> (англ. Tarzan) — титульный персонаж и протагонист одноимённого диснеевского полнометражного мультфильма 1999 года. Также с языка обезьян, Тарзан означает - белая кожа. Имеет заостренное лицо. Светлая кожа. Мускулистое тело. Волосы коричневого цвета длинной до плеч. Зелёные глаза. На ногах набедренная повязка. Очень смелый и сильный. В детстве он показал что он такой как другие. Убил леопарда Сабора который убил его родителей. Он справедливый. Спас Джейн от бабуинов. Убив Клейтона, спас многих горилл. Он очень ловкий. По лианам прыгает как обезьяна. Ножом убил леопарда Сабора. Без оружия убил Клейтона у которого был нож. В книге мать Тарзана умирает от болезни, а отца убивает Керчак от которого Кала спасла малыша."
},

{
  name: "vanilopa",
  char_text: "<b>Ванилопа фон Кекс</b> (англ. Vanellope von Schweetz) — девтерагонист диснеевского полнометражного мультфильма 2012 года «Ральф» и его сиквела. В соответствии со своей программой Ванилопа ведёт себя как девятилетний ребёнок - она очень энергична и любопытна. Так же во время волнения она постоянно подпрыгивает и восклицает (например «Я научусь водить, я научусь водить!»), что делает её похожей на настоящего ребёнка. У неё детское чувство юмора, а так же любит дразнить собеседников. Это видно по её дружбе с Ральфом, когда они придумывают друг другу смешные прозвища. Ванилопа – девочка невысокого роста. У неё светло-розовая кожа, большие карие глаза и черные волосы в причёске хвост пони с розовой декоративной проволочкой и конфетными блёстками. Основной персонаж гоночного игрового автомата с конфетным дизайном Сладкий Форсаж."
},

{
  name:"elastic",
  char_text:"<b>Хелен Парр</b> (англ. Helen Parr) (ранее Труакс (англ. Truax)), также известна, как <b>Эластика</b> (англ. Elastigirl) - второстепенный герой диснеевского/пиксаровского полнометражного мультфильма 2004 года «Суперсемейка», а также протагонист в сиквеле 2018 года. Она - эластичная и ловкая супергероиня, которая может растянуть любую часть своего тела до большой длины и разложить его на несколько форм и размеров. Хелен замужем за Мистером Исключительным (Бобом Парром), и у них трое детей, Фиалка, Шастик и Джек-Джек. Так до замужества с Мистером Исключительным она твёрдо намеревалась доказать, что способна быть героем и сломать рамки (т. к. в то время роль Супера была исключительно мужской). Она насмехалась над ролью домохозяйки."
},
{
  name:"meibl",
  char_text:"<b>Мэйбл Пайнс</b> (англ. Mabel Pines) — девтерагонистка диснеевского телевизионного мультсериала Гравити Фолз жизнерадостная, энергичная, гипер-активная, полна энтузиазма и свободно-настроена 12-летняя девочка (в конце сериала ей исполняется 13 лет), проводящая лето с дядей Стэном в Гравити Фолз, штат Орегон, где ей и её брату Дипперу приходится постоянно сталкиваться с паранормальными явлениями города. Брюнетка, носит брекеты и черные туфли с белыми носками. Постоянно вяжет свитера, в них и ходит. Носит короткие юбки разных цветов."
},
{
  name:"mike",
  char_text:"<b>Майкл «Майк» Вазовски</b> (англ. Michael «Mike» Wazowski) — девтерагонист полнометражного анимационного фильма Pixar Animation Studios 2001 года Корпорация монстров, а позже, протагонист его приквела 2013 года Университет монстров. Внешне Майк похож на колобка зелёного цвета. У него один глаз изумрудного цвета и пара маленьких рожек. Майк — гордый, целеустремлённый и уверенный монстр. Он является коллегой по работе и лучшим другом Салли, которого он каждое утро тренирует перед походом на работу."
},
{
  name:"dindin",
  char_text:"<b>Динь-Динь</b> (по транслитерации Тинкер Белл, в некоторых переводах Динь-Дилинь; англ. Tinker Bell) — основной персонаж диснеевского полнометражного мультфильма 1953 года «Питер Пэн» и протагонистка франшизы и серии мультфильмов «Феи Disney». Она — бойкая и дерзкая фея, являющаяся подругой и помощницей Питера Пэна. Несмотря на свой милый внешний вид, Динь-Динь очень независимая, своевольная, дерзкая, упрямая, вспыльчивая и очень активная. При встрече с различными представителями женского пола (например, Венди) она часто становится раздражительной и недовольной, в основном из-за ревности."
},
{
  name:"edrian",
  char_text:"<b>Адриан Агрест</b> (Adrien Agreste) — главный персонаж мультсериала. Адриан учится в классе мадам Бюстье в коллеже «Франсуа Дюпон». Он также является лицом бренда своего отца. Благодаря своему кольцу, в которое вселяется квами по имени Плагг, он превращается в супергероя Кота Нуара с силой разрушения. В эпизоде «Куклофекта» он ненадолго получает Камень Божьей Коровки, и с помощью квами по имени Тикки, трансформируется в Мистера Бага - супергероя с силой удачи и созидания. В эпизоде «Десперада» Ледибаг доверяет ему на время Камень Змеи, и с помощью квами по имени Сасс, он трансформируется в Аспика. Однако, он считает, что эта роль ему не подходит и возвращает ей камень чудес. В эпизоде «Белый Кот» попадает под влияние акумы и становится Белым Котом."
}

  ]

