let character_array = [
{
  name: "anna",
  width: "241.5px",
  char_text: "<b>Анна из Эренделла</b> (англ. Queen Anna of Arendelle) — протагонистка диснеевского мультфильма 2013 года «Холодное сердце» и девтерагонистка его сиквела 2019 года. Она младшая дочь короля Агнара и королевы Идуны и сестра Эльзы. В детстве её с сестрой разлучили после того как Эльза случайно ранила Анну магией. Анна была одна на протяжении тринадцати лет, но не смотря на это Анна оставалась великодушной и оптимистичной, хоть и немного неуклюжей. Когда спустя все эти годы Эльза случайно заморозила королевство и сбежала, Анна не смотря на опасности отправилась за ней, чтобы спасти королевство, вернуть свою сестру и после долгих лет восстановить с ней отношения. Три года спустя после коронации Эльзы, Анна и Эльза отправились в другое путешествие, чтобы противостоять стихийным духам Зачарованного Леса. Анна основана на Герде, главной героине сказки Ханса Кристиана Андерсена «Снежная королева»."
},
{
  name: "ariel",
  width: "345.83px",
  char_text: "<b>Ариэль</b> (англ. Ariel) — главный персонаж и протагонистка диснеевского полнометражного мультфильма 1989 года «Русалочка». Она — младшая дочь морского царя Тритона и царицы Афины, правителей подводного царства Атлантики. Ариэль — четвёртая официальная диснеевская принцесса и примечательна тем, что является единственной из них нечеловеческого происхождения.  Ариэль — яркая, энергичная и упрямая девушка с сильной страстью к приключениям. Ариэль всегда в движении и никогда не сидит на месте. Её склонность к исследованию более таинственных глубин океана (или, что более важно, мира за его пределами) часто приводит к множеству проблем. Но, несмотря на это, самоотверженность, сострадание и интуитивное мышление Ариэль часто позволяют решать подобные проблемы, так как она всегда берёт на себя полную ответственность за свои действия."
},
{
  name: "avrora",
  width: "453.167px",
  char_text: "<b>Принцесса Аврора</b> (англ. Princess Aurora; также известная как Дикая Роза, англ. Briar Rose) — заглавный персонаж и протагонистка диснеевского полнометражного мультфильма 1959 года «Спящая красавица». Она — единственная дочь короля Стефана и королевы Лии, ещё ребёнком ставшая жертвой колдовства злой феи Малефисенты. Разозлённая на её родителей колдунья наложила на принцессу заклятие, согласно которому Аврора должна умереть в день своего шестнадцатилетия, уколов палец о веретено прялки. Однако усилия трёх добрых фей позволили смягчить проклятие, заменив смерть на глубокий волшебный сон, от которого «спящую красавицу» способен пробудить только поцелуй истинной любви. Аврора — третья официальная диснеевская принцесса и примечательна тем, что является последней из них, созданной при жизни Уолта Диснея."
},
{
  name: "belle",
  width: "371.5px",
  char_text: "<b>Белль</b> (англ. Belle) — заглавный персонаж и протагонистка диснеевского полнометражного мультфильма 1991 года «Красавица и Чудовище». Она — храбрая, интеллигентная и невероятно красивая молодая девушка, которая мечтает вырваться из своего небольшого провинциального городка и жить жизнью полной приключений. Белль — пятая официальная диснеевская принцесса и примечательна тем, что является второй из них некоролевского происхождения после Золушки. Белль — умная и интеллигентная девушка, которая, благодаря своей любви к чтению, за многие годы накопила значительный объём знаний, большой словарный запас, богатое воображение и открытое мышление. Она очень откровенна и уверенна в своих убеждениях и потому очень не любит, когда ей говорят, что делать. Несмотря на это, друзей у Белль не слишком много. Её ум и открытое мышление выделяют её среди других жителей городка."
},
{
  name: "cinderella",
  width: "373.83px",
  char_text: "<b>Золушка</b> (англ. Cinderella) — главный персонаж и протагонистка одноимённого диснеевского полнометражного мультфильма 1950 года. Она — родная дочь овдовевшего дворянина, которая после его скоропостижной смерти становится служанкой собственной бессердечной мачехи леди Тремейн. Несмотря на постоянные унижения и жестокость со стороны своей завистливой сводной семьи, девушка всегда оставалась нежной и доброй и никогда не переставала верить и надеяться на лучшую жизнь. Золушка — вторая официальная диснеевская принцесса. Золушка — трудолюбивая и независимая девушка, которая никогда не позволяет злости или горю взять над собою верх. Она очень добра к окружающим и никаким образом не изображена наивной или инфантильной. Золушка — молодая девушка с классически красивыми чертами внешности."
},
{
  name: "jasmine",
  width: "371.83px",
  char_text: "<b>Принцесса Жасмин</b> (англ. Princess Jasmine, араб. الأميرة ياسمين‎) — девтерагонистка диснеевского полнометражного мультфильма 1992 года «Аладдин». Она — волевая и независимая принцесса средневосточного королевства Аграба, которым правит её отец-султан. Рождённая в обществе, в котором с ней обращаются скорее как с вещью, нежели как с человеком, Жасмин стремится сбежать от навязанных ей ограничений и зажить жизнью, в которой она сама сможет принимать решения и делать лишь свои собственные выборы. Жасмин — шестая официальная диснеевская принцесса и примечательна тем, что является первой из них неевропейского происхождения. Жасмин весьма многогранный персонаж: она невероятно сильная и независимая во многих отношениях. Она никогда не боится открыто высказывать своё мнение, независимо от того, кому ей приходится противостоять."
},
{
  name: "merida",
  width: "487.9px",
  char_text: "<b>Принцесса Мерида</b> (англ. Princess Merida) — протагонистка диснеевского/пиксаровского полнометражного мультфильма 2012 года «Храбрая сердцем». Мерида одиннадцатая диснеевская принцесса, и первая родом из Pixar. Мерида упрямая и свободолюбивая 16-летняя девушка, своевольная дочь королевы Элинор, которая правит королевством вместе со своим мужем, королём Фергусом. Несмотря на желание Элинор видеть Мериду настоящей королевской леди, Мерида импульсивная девушка, которая хочет взять под контроль свою собственную судьбу. Мерида оттачивала свое мастерство в стрельбе из лука и является одним из самых опытных лучников, когда-либо виденных. Она также искусна в боях на мечах и гонках по сельской местности на своем коне Ангусе. Несмотря на свою общительную, сильную, упрямую и своевольную личность, Мерида обладает игривой мягкостью сердца."
},
{
  name: "moana",
  width: "513.167px",
  char_text: "<b>Моана</b> (англ. Moana) — главный персонаж и протагонистка одноимённого диснеевского полнометражного мультфильма 2016 года. Моана отважная, упрямая, волевая и практически бесстрашная. Она имеет тёмно каштановые волосы ,смуглую кожу ,карие глаза. Моана является подростком, которая мечтает стать исследователем. С детства она была очарована богатством легенд и преданий, которые на протяжении веков расходились по всем островам южной части Тихого Океана, большинство из которых повествовали о легендарных богах и богинях, таких как полубог Мауи. Всё больше углубляясь в легенды, она всегда поддерживала свою бабушку, Тала, которая была твёрдо уверена в том, что Моане суждено однажды отправится в путешествие, и исследовать моря, также как это когда-то делали её предки до неё. <br>«Я — Моана из Мотунуи. Я сяду в лодку, пересеку океан и верну сердце Те Фити.»"
},
{
  name: "mulan",
  width: "511.167px",
  char_text: "<b>Фа Мулан</b> (англ. Fa Mulan, кит. 花木蘭) — титульный персонаж и протагонистка одноимённого диснеевского полнометражного мультфильма 1998 года. Мулан — восьмая официальная принцесса Disney и единственная героиня данной франшизы, которая не является фактической принцессой ни по рождению, ни по замужеству. Мулан смелая, трудолюбивая девушка. Дисциплинированна и умна, а также очень ответственна. Отважная и свободолюбивая красавица Мулан — дочь опытного китайского воина Фа Зу, от которого она унаследовала любовь к родине и готовность защищать её. Верная идеалам, Мулан в мужском обличье отправляется на войну вместо отца. Благодаря мужеству и отваге, а также верному спутнику — маленькому дракону Мушу, принцесса героически справляется с множеством испытаний, чтобы спасти Китай, вернуться домой к родным и, конечно же, найти свою любовь."
},
{
  name: "pocahontas",
  width: "303.75px",
  char_text: "<b>Покахонтас</b> (англ. Poсahontas) — главная героиня и протагонистка одноименного диснеевского полнометражного мультфильма 1995 года. Она — дочь вождя племени индейцев, которая мечтает установить мир между её племенем и английскими колонистами. Покахонтас характером очень добрая, и умеет понимать исключительно всех, и сделает всё, чтобы помочь. Именно она внушила Джону Смиту, что важно слушать природу - и она подскажет тебе правильный путь. Эту мысль ей внушала её наставница - бабушка Ива, очень мудрая и добрая. Покахонтас — дочь индейского вождя. Она воплощает в себе главные черты своего племени: смелость, свободолюбие, любовь к земле и заботливое отношение ко всему живому. Она живёт в полной гармонии с природой, и ей нравится исследовать мир вокруг себя. Когда в места, обжитые её племенем, прибывают англичане, неравнодушная принцесса делает все, что в её силах, чтобы предотвратить войну."
},
{
  name: "raps",
  width: "390.5px",
  char_text: "<b>Рапунцель</b> (англ. Rapunzel) — заглавный персонаж и протагонистка диснеевского полнометражного мультфильма 2010 года «Рапунцель: Запутанная история». Она — наследная принцесса королевства Корона, которая ещё ребёнком была похищена злой ведьмой и спрятана в тайной башне на восемнадцать лет. За это время девушка стала обладательницей длинных золотистых волос и увлеклась тайной «летающих огоньков», появляющихся в небе только в её день рождения. Заручившись помощью обаятельного вора Флина Райдера, Рапунцель сбежала из башни, чтобы, наконец, раскрыть загадку огоньков и осуществить свою давнюю мечту исследовать мир за её стенами. Рапунцель — энергичная и решительная молодая девушка, обладающая весьма сильной тягой к приключениям."
},
{
  name: "tiana",
  width: "426px",
  char_text: "<b>Тиана</b> (англ. Tiana) — главный персонаж диснеевского полнометражного мультфильма 2009 года «Принцесса и лягушка». Она — трудолюбивая и талантливая повариха, живущая в новоорлеанском французском квартале, которая мечтает открыть свой собственный ресторан. Тиана — девятая официальная диснеевская принцесса и примечательна тем, что является первой афроамериканской героиней данной линейки. Тиана интеллигентная, находчивая и невероятно талантливая девушка. Тем не менее, в самом начале фильма, а также на протяжении его большей части, она показана слишком напряжённой и чересчур поглощённой работой, чтобы сосредоточиться на отдыхе, друзьях и семье. Тиана — девятнадцатилетняя афроамериканская девушка. Она высокая и стройная; у неё тёмная кожа, волнистые чёрные волосы длиной до плеч, зачастую заплетённые в хвостик, тёмно-карие глаза, красные губы, а также ямочки на щёках."
},
{
  name: "white",
  width: "426.5px",
  char_text: "<b>Белоснежка</b> (англ. Snow White) — заглавный персонаж и протагонистка диснеевского полнометражного мультфильма 1937 года «Белоснежка и семь гномов», а также первая каноническая героиня в истории полнометражных мультипликационных фильмов студии Disney. Она — юная принцесса, которая благодаря безгранично доброму нраву и привлекательной внешности считается самой прекрасной девушкой на свете, чем вызывает ненависть своей злой и тщеславной мачехи-королевы. Белоснежка — самая первая и самая юная официальная диснеевская принцесса, чей образ впоследствии послужил основой для ещё нескольких героинь, таких как Золушка и Аврора из «Спящей красавицы». Кроме того, многие из черт Белоснежки, в частности, королевское происхождение, дружелюбное отношение к животным и любовь к пению, и по сей день продолжают вдохновлять как героев, так и героинь диснеевских мультфильмов."
},
{
  name: "elsa",
  width: "444px",
  char_text: "<b>Эльза</b> (англ. Elsa) — девтерагонистка диснеевского полнометражного мультфильма 2013 года «Холодное сердце» и протагонистка его сиквела 2019 года. Она — перворождённая дочь короля Агнара и королевы Идуны, старшая сестра королевы Анны и бывшая правительница королевства Эренделл, хорошо известная благодаря своим волшебным способностям создавать и контролировать снег и лёд. Через три года своего правления Эльза отрекается от престола Эренделла, чтобы занять свое законное место в качестве Снежной королевы — пятого духа Зачарованного леса, связывающего обычных людей с магией природы. Эльза — спокойная, сдержанная и уравновешенная молодая девушка, под изящной внешностью которой скрывается довольно сложная личность: благодаря травматическому инциденту, пережитому в детстве, она большую часть своей жизни была обеспокоена своими магическими способностями. "
},
{
  name: "sofia",
  width: "397.167px",
  char_text: "<b>Принцесса София</b> (англ. Princess Sofia) — заглавный персонаж и протагонистка диснеевского телевизионного мультсериала «София Прекрасная». София - очень добрая, всегда готова помочь. Заботливая, беспокоиться за всех. Скромная и в тоже время общительная, пытается со всеми найти общий интерес. Дружелюбная, щедрая и смышлёная. Весёлая со своими друзьями. София очень сообразительная, что помогает ей найти выход из самых сложных ситуаций (пусть иногда не без помощи). Способность принцессы поддерживать людей помогает ей выручать своих друзей в разных ситуациях. Так, она помогла своему другу Хьюго признаться его отцу в пристрастии к фигурному катанию, помогла принцессе Клио преодолеть зависимость от Хильдегарды и принять участие в мюзикле."
}
]
