let character_array = [
{
  name: "aid",
  char_text: "<b>Аид</b> (англ. Hades) — главный антагонист диснеевского полнометражного мультфильма 1997 года «Геркулес». Он — древнегреческий бог подземного царства мёртвых. Аид является одним из самых популярных Злодеев Disney, а также одним из самых смешных из них. Несмотря на то, что Аид бог мёртвых, он достаточно живой. Он легко приходит в ярость, пытается шутить. Считает себя добрым парнем, который просто ненавидит Геркулеса. У Аида бледная кожа, что подчёркивает его связь с мёртвыми, и жёлтые глаза. Он носит чёрную тогу, состоящую из дыма. На голове вместо волос синее пламя, становящаяся красным когда Аид приходит в ярость. Как бог он всемогущ. Он может телепортироваться, создавать вещи и тому подобное. Часто швыряет огнём."
},

{
  name: "CaptainHook",
  char_text: "<b>Капитан Крюк</b> (англ. Captain Hook) — главный антагонист диснеевского полнометражного мультфильма 1953 года «Питер Пэн». Он — вспыльчивый и жестокий предводитель команды пиратов на борту Весёлого Роджера и заклятый враг Питера Пэна. Капитан Крюк — грозный и хитрый негодяй. Однако он часто выставляет себя дураком, но, несмотря на это, он довольно кровожаден. Например, в оригинальном мультфильме он насмерть застрелил одного из своих пиратов из-за его пения, а позднее в злости выбросил другого пирата за борт при помощи одного своего крюка. Крюк очень умён и хорошо умеет манипулировать другими. Капитан Крюк носит красивый красный сюртук, красные штаны и чёрные туфли. На месте левой руки у него крюк. Образ капитана дополняет широкополая шляпа. У Крюка густые чёрные волосы и тонкие усики"
},
{
  name: "cruella",
  char_text: "<b>Стервелла Де Виль</b> (по транслитерации Круэлла Де Виль; англ. Cruella De Vil) — главная антагонистка диснеевского полнометражного мультфильма 1961 года «Сто один далматинец». Она — богатая наследница и старая школьная подруга Аниты Рэдклифф. Имея нездоровую страсть к моде, она помешана на мехах и потому похищает 99 щенков-далматинцев, чтобы сшить из их шкурок меховое манто. Стервелла является одной из самых популярных и общепризнанных диснеевских персонажей всех времён. Стервелла известна своей грубостью и надменностью. Несмотря на то, что она любит внимание, Стервелла смотрит на других свысока и относясь к ним неуважительно, не проявляет ни сочувствия, ни заботы о ком-либо. Стервелла любит носить меховые шубы. Своеобразная мания. Одна сторона волос чёрная, другая белая."
},
{
  name: "doc",
  char_text: "<b>Доктор Фасилье</b> (англ. Doctor Facilier; также известен как Человек-тень, англ. The Shadow Man) — главный антагонист диснеевского полнометражного мультфильма 2009 года «Принцесса и лягушка». Он — злой колдун вуду, который хочет захватить власть над Новым Орлеаном при помощи своих «друзей из ада». Доктор Фасилье — хитрый мошенник, таинственный и грозный персонаж, который несёт нешуточную угрозу Принцу Навину и Тиане. Этот ловкий делец пользуется волшебными заклинаниями и «потусторонними связями», чтобы добиваться своих загадочных и опасных целей. Прекрасно разбирается в магии вуду. Может сделать куклу любого человека или изменить его внешность. Правда его сила скорее всего идёт от вуду-богов."
},
{
  name: "fuf",
  char_text: "<b>Доктор Хайнц Фуфелшмертц</b>, Фуфелшмертц, Хайнц или Фуфел. Глава «Фуфелшмертц Пакость Инкорпорейтед». Глуповатый и злобный учёный. Родился в Друсельштейне  - стране, напоминающей Германию, о чём говорит его специфический акцент, в городе Гиммельштумпе. Один из его предков жил в Англии. Обычно употребляет глаголы в неопределённой форме. Часто рассказывает Перри истории из своей жизни. Каждый раз он придумывает необычные изобретения с названиями, заканчивающимися на «-инатор» (кроме «разруш-испарителя» и «сморщесферы», хотя сам Хайнц честно признался что хотел назвать её «сморщинатор»). Пытается отомстить всему миру за свое несчастливое детство, ненавидит своего младшего брата Роджера и мечтает захватить власть над Триштатьем"
},
{
  name: "izma",
  char_text: "<b>Изма</b> (англ. Yzma) — главная антагонистка диснеевского полнометражного мультфильма 2000 года «Похождения императора». Она — бывшая советница императора Кузко, которая превращает его в ламу и пытается избавиться, чтобы провозгласить себя новой императрицей инков. Изма — главная злодейка, колдунья-неудачница, очень стара и некрасива. Старается завладеть троном, ликвидируя Кузко, либо мешая ему закончить школу, в одной серии ей это удалось, но Кузко выпутался из положения и вернулся к власти ,выдает себя за директора Амзи. Как было показано, Изму часто обзывают динозавром, что очень её раздражает. Внешне Изма похожа на другую злодейку - Стервеллу. Основные цвета её — чёрный и фиолетовый, причём в её наряде присутствуют перья, что показывает её пышность."
},
{
  name: "malefisenta",
  char_text: "<b>Малефисента</b> (по транслитерации Малефисент, в ранних переводах Дьяволина; англ. Maleficent) — главная антагонистка диснеевского полнометражного мультфильма 1959 года «Спящая красавица». Она — могущественная тёмная фея, наводящая ужас на королевство короля Стефана. Именно Малефисента наложила смертоносное заклятие на принцессу Аврору, желая тем самым поквитаться с её родителями, которые не пригласили гордую и мстительную колдунью на крестины дочери. Будучи воплощением абсолютного зла, Малефисента является заклятым врагом трёх добрых фей — Флоры, Фауны и Меривезы, которые делают всё, что в их силах, чтобы противостоять могуществу колдуньи и не позволять её коварным планам сбыться. Малефисента представляет собой живое олицетворение истинного и абсолютного зла, чья главная цель в жизни — сеять вокруг себя хаос и разрушение."
},
{
  name: "queen",
  char_text: "<b>Королева</b> (Дама) Червей (англ. Queen of Hearts) — главная антагонистка диснеевского полнометражного мультфильма 1951 года «Алиса в Стране чудес». Она — деспотичная, вспыльчивая и жестокая правительница Страны чудес, которая всегда предпочитает решать все свои проблемы одним способом — отрубать головы тем, кто разгневал её. Характер Королевы в точности соответствует характеру оригинала - она так же легко впадает в ярость и решает проблемы самым простым способом - отрубанием головы. Королева выглядит как крупная черноволосая дама. На голове у неё маленькая корона. Она носит чёрно-красное платье и веер в виде сердца."
},
{
  name: "shram",
  char_text: "<b>Шрам</b> (также известен как Така или Скар от англ. Scar — «шрам») — младший брат Муфасы, дядя Симбы. Является главным антагонистом анимационного фильма «Король Лев» и второго сезона анимационного сериала «Хранитель Лев». Шрам — поджарый, худощавый, гибкий, грациозный лев с тёмно-рыжей гладкой шерстью, негустой чёрной гривой, тёмными окантовками вокруг глаз, светлыми участками шерсти на морде и животе, заострённым чёрным носом и холодными изумрудными глазами. Его отличительная черта — тонкий розовый шрам, рассекающий левый глаз, благодаря которому лев и получил своё имя. Шрам умный, коварный, злой. Острый ум и проницательность позволяют ему строить честолюбивые планы. Он умеет манипулировать львами и оказывать на них негативное влияние."
},
{
  name: "ursula",
  char_text: "<b>Урсула</b> (англ. Ursula) — главная антагонистка диснеевского полнометражного мультфильма 1989 года «Русалочка». Урсула — зловещая морская ведьма, которая «помогает» невезучим морским обитателям для достижения её собственных целей. По своей природе Урсула очень мрачная и зловещая колдунья со своеобразным чувством юмора. Она печально известна среди всех жителей морей и одно ее упоминание вызывает у каждого трепет. Она очень тщеславна, коварна и властолюбива, но обладает искусным ораторским талантом. Урсула - опытная ведьма и ее магические способности, даже без трезубца, очень могущественны."
},
{
  name:"verian",
  char_text:"<b>Вэриан</b> (англ. Varian) — второстепенный, впоследствии основной персонаж диснеевского телевизионного мультсериала «Рапунцель: Новая история». Он является главным антагонистом в конце первого сезона, пока в итоге не исправляется в третьем. Вэриан в начале сериала появился как добрый, милый и весьма неуклюжий парень, но постепенно он стал меняться из-за ситуации и происходящего. Когда он появился во второй раз, стали ясны его чувства к Кассандре. Он стал более уверенным и разговорчивым. Также, когда Кассандра не смогла стать его ассистентом, тот расстроился, но не перестал испытывать к ней тёплые чувства."
},
{
  name:"zl",
  char_text:"<b>Лорд Злыдень</b> (по транслитерации также известен как Лорд Хейтер; англ. Lord Hater) — главный антагонист первого сезона диснеевского телевизионного мультсериала «С приветом по планетам». Злыдень злой и жестокий тиран. Он ненавидит, когда кто-нибудь указывает ему, как поступать. Особенно если это исходит от нижестоящего. Но особенно Злыдень ненавидит Тут-и-Там, который является его противоположностью (и считает Злыдня своим другом). Поэтому он тратит много сил на его уничтожение и поимку, несмотря на уговоры Гляделкинса. В то же время легкомысленно к Злыдню относится нельзя - иногда он бывает очень опасен и сосредоточен. Внешне Лорд Злыдень - это скелет. Его лицо - это череп, чьи зубы похожи на осколки. У него зелёные глаза, как будто плавающие внутри глазниц. Злыдень носит чёрно-красный плащ с капюшоном, который покрывает всю верхнюю часть его головы. Этот капюшон украшен двумя жёлтыми молниями. На руках он носит жёлтые перчатки, напоминающие хозяйственные. На ногах у него кеды. Он полностью из костей"
},
{
  name:"evil",
  char_text:"<b>Злая королева</b> (англ. The Evil Queen; или просто королева, англ. The Queen) — главная антагонистка диснеевского полнометражного мультфильма 1937 года «Белоснежка и семь гномов» и первая каноническая злодейка в истории полнометражных диснеевских мультипликационных фильмов. Она — тщеславная и завистливая мачеха принцессы Белоснежки, преисполненная решимости стать самой прекрасной женщиной на свете. Безумно завидуя красоте своей падчерицы и опасаясь, что та однажды превзойдет её собственную, одержимая королева решает избавиться от своей главной соперницы и в конечном итоге использует тёмную магию в виде отравленного яблока, чтобы раз и навсегда расправиться с Белоснежкой. О прошлом королевы ничего не упоминается, но, тем не менее, точно известно, что она обладала магическими способностями и имела большие знания в искусстве чёрной магии. В какой-то момент своей жизни она познакомилась и вышла замуж за овдовевшего короля, став мачехой его дочери от первого брака."
},
{
  name:"gid",
  char_text:"<b>Гидеон Чарльз Глифул</b> (англ. «Li'l» Gideon Charles Gleeful) — ребёнок, выдающий себя за телепата. Жажда власти мотивирует его манипулировать и запугивать людей, вынуждая их делать то, что нужно ему.Он заклятый враг семьи Пайнс и главный антагонист первого сезона Гравити Фолз, пока не попадает в тюрьму. Несмотря на то, что он длительное время являлся врагом и антагонистом сериала, он понимает, что его прежний путь был неверен и пытается начать все сначала, как хороший, обычный ребенок. Ему соответствует пятиконечная звезда с глазом в центре на колесе Билла. Семья Пайнс - ему враг, но ему нравится Мэйбл. И хотя та старше Гидеона на 2 года, он все равно её любит и хочет завоевать её сердце."
},
{
  name:"shego",
  char_text:"<b>Шиго</b> (англ. Shego) — вымышленный персонаж мультсериала «Ким Пять-с-Плюсом ». Главный женский злодей и антагонист. У Шиго длинные (до пояса), пышные чёрные волосы и зелёные глаза. У неё великолепная фигура, которая подчёркнута облегающим зелёно-чёрным костюмом, который она редко меняет. По характеру она очень похожа на Дракена. Так она любит воровать и делать злые вещи. Так же она показана весьма умной и сообразительной. Шиго - коварная помощница доктора Драккена. Вольная и хитрая. Обладает боевыми искусствами. Где и каким боевым искусствам обучалась Шиго, в сериале не указывается, но она способна в рукопашной схватке обезвредить несколько хорошо обученных противников."
}
  ]
